#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
module.main.data.archive_file.lambda_zip: Reading...
module.main.data.archive_file.lambda_zip: Read complete after 0s [id=198c4c19b0b507b3e47e04c32aa96cd2819b8e73]
module.main.aws_iam_role.lambda_role: Refreshing state... [id=lapwing-item-news-dev-lambda-role]
module.main.aws_ssm_parameter.twitter_access_token_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessTokenSecret]
module.main.aws_ssm_parameter.twitter_api_key: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiKey]
module.main.aws_ssm_parameter.twitter_access_token: Refreshing state... [id=/lapwing-item-news/dev/Twitter/AccessToken]
module.main.aws_scheduler_schedule_group.group: Refreshing state... [id=lapwing-item-news-dev-scheduler-group]
module.main.aws_iam_role.scheduler_role: Refreshing state... [id=lapwing-item-news-dev-scheduler-role]
module.main.aws_ssm_parameter.twitter_api_secret: Refreshing state... [id=/lapwing-item-news/dev/Twitter/ApiSecret]
module.main.aws_s3_bucket.bucket: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=lapwing-item-news-dev-bucket]
module.main.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]
module.main.aws_lambda_function.lambda_function: Refreshing state... [id=lapwing-item-news-dev-lambda]
module.main.aws_iam_role_policy_attachment.lambda: Refreshing state... [id=lapwing-item-news-dev-lambda-role/arn:aws:iam::087164360110:policy/lapwing-item-news-dev-lambda-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.main.aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/lapwing-item-news-dev-lambda"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags_all          = {
          + "project" = "lapwing-item-news"
          + "stage"   = "dev"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: `HiroM320`, Stage: `dev`*

If you want to deploy this, please comment the following text.
```
/deploy 18246112428
```